#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.v2: Refreshing state... [id=v2.sondehub.org]
aws_sqs_queue.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_ecs_cluster.ws: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/ws]
aws_iam_role.sign_socket: Refreshing state... [id=sign_socket]
aws_iam_service_linked_role.IAMServiceLinkedRole3: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/ops.apigateway.amazonaws.com/AWSServiceRoleForAPIGateway]
aws_ecr_repository.wsproxy: Refreshing state... [id=wsproxy]
aws_acm_certificate.CertificateManagerCertificate_root: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/a7da821c-bdbc-404b-aa12-bce28d86cdeb]
aws_appautoscaling_target.ws_reader: Refreshing state... [id=service/ws/ws-reader]
aws_apigatewayv2_api.main: Refreshing state... [id=r03szwwq41]
aws_iam_role.history: Refreshing state... [id=history]
aws_iam_role.recovered: Refreshing state... [id=recovered]
aws_iam_role.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5]
aws_s3_bucket.cf_logs: Refreshing state... [id=sondehub-cloudfront-logs]
aws_iam_role.predict_updater: Refreshing state... [id=predict-updater]
aws_iam_role.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole]
aws_iam_role.IAMRole3: Refreshing state... [id=CognitoAccessForAmazonES]
aws_appautoscaling_target.tawhiri: Refreshing state... [id=service/Tawhiri/tawhiri]
aws_sqs_queue.historic_to_s3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/update-history]
aws_route53_zone.Route53HostedZone: Refreshing state... [id=Z0571575V2EX2P3LK16U]
aws_iam_service_linked_role.IAMServiceLinkedRole: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/es.amazonaws.com/AWSServiceRoleForAmazonElasticsearchService]
aws_acm_certificate.CertificateManagerCertificate: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/e2187cc3-6098-4ac9-917e-acd414bdb75e]
aws_cloudwatch_event_rule.predict_updater: Refreshing state... [id=predict_updater]
aws_sns_topic.sonde_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem]
aws_s3_bucket.predict: Refreshing state... [id=sondehub-predict]
aws_vpc.main: Refreshing state... [id=vpc-0a0baa77]
aws_cloudwatch_event_rule.history: Refreshing state... [id=history_queue]
aws_efs_file_system.tawhiri: Refreshing state... [id=fs-519cd0e5]
aws_ecs_task_definition.ws: Refreshing state... [id=ws]
aws_s3_bucket.history: Refreshing state... [id=sondehub-history]
aws_s3_bucket.card: Refreshing state... [id=sondehub-v2-card]
aws_iam_role.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_iam_role.historic: Refreshing state... [id=historic]
aws_cognito_user_pool.CognitoUserPool: Refreshing state... [id=us-east-1_G4H7NMniM]
aws_ecs_cluster.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/Tawhiri]
aws_ecr_repository.tawhiri: Refreshing state... [id=tawhiri]
aws_iam_role.ws: Refreshing state... [id=ws]
aws_ecr_repository.tawhiri_downloader: Refreshing state... [id=tawhiri-downloader]
aws_appautoscaling_policy.ws_reader: Refreshing state... [id=ws-reader-tt]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_lambda_function.sign_socket: Refreshing state... [id=sign-websocket]
aws_appautoscaling_policy.tawhiri: Refreshing state... [id=cpu]
aws_iam_role_policy.history: Refreshing state... [id=history:terraform-20210215030637833400000001]
aws_iam_role_policy.recovered: Refreshing state... [id=recovered:recovered]
aws_lambda_function.sns_to_mqtt: Refreshing state... [id=sns-to-mqtt]
aws_iam_role_policy.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5:iot]
aws_lambda_function.get_sondes: Refreshing state... [id=query]
aws_lambda_function.station: Refreshing state... [id=station-api-to-iot-core]
aws_lambda_function.get_telem: Refreshing state... [id=get_telem]
aws_lambda_function.history: Refreshing state... [id=history]
aws_lambda_function.redirect: Refreshing state... [id=sondehub-redirect]
aws_lambda_function.get_listener_telemetry: Refreshing state... [id=get_listener_telemetry]
aws_lambda_function.predictions: Refreshing state... [id=predictions]
aws_lambda_function.reverse_predictions: Refreshing state... [id=reverse-predictions]
aws_lambda_function.get_sites: Refreshing state... [id=get_sites]
aws_iam_role_policy.predict_updater: Refreshing state... [id=predict-updater:predict_updater]
aws_ecs_task_definition.ws_reader: Refreshing state... [id=ws-reader]
aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole-20211026015558575000000001]
aws_iam_role_policy.efs: Refreshing state... [id=ecsTaskExecutionRole:EFS]
aws_iam_role_policy.kms: Refreshing state... [id=ecsTaskExecutionRole:kms]
aws_sns_topic_subscription.sqs_to_elk: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem:1a52ac41-6e17-43da-bfb6-114577c94ca6]
aws_lambda_function.upload_telem: Refreshing state... [id=sonde-api-to-iot-core]
aws_sqs_queue_policy.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_ecs_task_definition.tawhiri_ruaumoko: Refreshing state... [id=tawhiri-ruaumoko]
aws_route53_record.cert_validation["*.v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_route53_record.cert_validation["v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_ecs_task_definition.tawhiri: Refreshing state... [id=tawhiri]
aws_cognito_user_pool_client.CognitoUserPoolClient: Refreshing state... [id=62uut02s5ts991uhpf4fbuvrtj]
aws_iam_role_policy.sqs_to_elk: Refreshing state... [id=sqs-to-elk:sqs_to_elk]
aws_iam_role_policy.historic: Refreshing state... [id=historic:historic]
aws_s3_bucket_policy.S3BucketPolicy: Refreshing state... [id=v2.sondehub.org]
aws_apigatewayv2_integration.sign_socket: Refreshing state... [id=3z0z19e]
aws_lambda_permission.sign_socket: Refreshing state... [id=terraform-20210201060604212000000001]
aws_iam_role_policy.s3_config: Refreshing state... [id=ws:s3-config]
aws_iam_role_policy_attachment.ws: Refreshing state... [id=ws-20211026015558574900000002]
aws_security_group.lb: Refreshing state... [id=sg-0425f0e462f849164]
aws_subnet.ws_main: Refreshing state... [id=subnet-062e92591b41338d6]
aws_subnet.private["us-east-1a"]: Refreshing state... [id=subnet-0a3559e6c60534d32]
aws_subnet.private["us-east-1c"]: Refreshing state... [id=subnet-07308ab971680b901]
aws_subnet.private["us-east-1f"]: Refreshing state... [id=subnet-0da5e895f93b6f106]
aws_subnet.private["us-east-1d"]: Refreshing state... [id=subnet-03512eaff0c9442b3]
aws_subnet.private["us-east-1e"]: Refreshing state... [id=subnet-034d5414804d2675f]
aws_subnet.private["us-east-1b"]: Refreshing state... [id=subnet-0896109fa272ce2a5]
aws_internet_gateway.gw: Refreshing state... [id=igw-b5988cce]
aws_lb_target_group.ws_reader: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws-reader/505318ab8a79f70b]
aws_security_group.tawhiri_alb: Refreshing state... [id=sg-009775f4b64627830]
aws_security_group.tawhiri_efs: Refreshing state... [id=sg-0c02c0854e5376885]
aws_egress_only_internet_gateway.main: Refreshing state... [id=eigw-07166246a33f04b24]
aws_lb_target_group.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/tawhiri/eef603500a548185]
aws_lb_target_group.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws/deda6fb24618e1bd]
aws_route_table.main: Refreshing state... [id=rtb-0efda81da4e7baf2b]
aws_security_group.ws_writer: Refreshing state... [id=sg-09a8e16a347be7a57]
aws_subnet.public["us-east-1c"]: Refreshing state... [id=subnet-408d1c1f]
aws_subnet.public["us-east-1e"]: Refreshing state... [id=subnet-5c34ec6d]
aws_subnet.public["us-east-1f"]: Refreshing state... [id=subnet-204b052e]
aws_subnet.public["us-east-1a"]: Refreshing state... [id=subnet-de4ddeff]
aws_subnet.public["us-east-1b"]: Refreshing state... [id=subnet-7b1c3836]
aws_subnet.public["us-east-1d"]: Refreshing state... [id=subnet-a7f460c1]
aws_lambda_permission.station: Refreshing state... [id=terraform-20210401090915325300000001]
aws_cloudfront_distribution.predict: Refreshing state... [id=E258SM01Q3NTFC]
aws_apigatewayv2_integration.stations: Refreshing state... [id=mwpzl34]
aws_lambda_permission.sns_to_mqtt: Refreshing state... [id=terraform-20211027235710712300000001]
aws_lambda_permission.history: Refreshing state... [id=terraform-20210215030703150600000002]
aws_apigatewayv2_integration.history: Refreshing state... [id=66le01p]
aws_apigatewayv2_integration.get_listener_telemetry: Refreshing state... [id=ab3t2lo]
aws_lambda_permission.get_sondes: Refreshing state... [id=terraform-20210202070651842200000001]
aws_lambda_permission.get_listener_telemetry: Refreshing state... [id=terraform-20210721094823635000000001]
aws_apigatewayv2_integration.get_sondes: Refreshing state... [id=6ukw9c9]
aws_s3_bucket_policy.S3BucketPolicy2: Refreshing state... [id=sondehub-history]
aws_cloudfront_distribution.card: Refreshing state... [id=E1U5IIXI87Q160]
aws_apigatewayv2_integration.reverse_predictions: Refreshing state... [id=twwzlck]
aws_lambda_permission.reverse_predictions: Refreshing state... [id=terraform-20211009045533567800000001]
aws_apigatewayv2_integration.get_sites: Refreshing state... [id=lhog6mf]
aws_apigatewayv2_integration.get_telem: Refreshing state... [id=jimf7df]
aws_lambda_permission.get_sites: Refreshing state... [id=terraform-20211004105421479600000001]
aws_lambda_permission.get_telem: Refreshing state... [id=terraform-20210202103643622900000001]
aws_lambda_permission.predictions: Refreshing state... [id=terraform-20210222053152988200000001]
aws_apigatewayv2_integration.predictions: Refreshing state... [id=qsw8rmd]
aws_apigatewayv2_route.sign_socket: Refreshing state... [id=q5dgv70]
aws_cognito_identity_pool.CognitoIdentityPool: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_acm_certificate_validation.CertificateManagerCertificate: Refreshing state... [id=2021-01-29 07:25:49 +0000 UTC]
aws_network_interface.ws_pad[3]: Refreshing state... [id=eni-0d40407d608d35e38]
aws_security_group.tawhiri: Refreshing state... [id=sg-006470b1ebfd4a08c]
aws_network_interface.ws_pad[6]: Refreshing state... [id=eni-069ebf56c9e4fdd7f]
aws_network_interface.ws_pad[2]: Refreshing state... [id=eni-0ddc45ce32abb4a58]
aws_network_interface.ws_pad[1]: Refreshing state... [id=eni-0d808bd7acad70c66]
aws_network_interface.ws_pad[5]: Refreshing state... [id=eni-0776494ae4f908042]
aws_network_interface.ws_pad[7]: Refreshing state... [id=eni-054a9210306259e1b]
aws_network_interface.ws_pad[4]: Refreshing state... [id=eni-01e4afb86960a27cf]
aws_network_interface.ws_pad[8]: Refreshing state... [id=eni-07c92d00c031482ec]
aws_route_table_association.ws_main: Refreshing state... [id=rtbassoc-021c8735f65874b12]
aws_network_interface.ws_pad[0]: Refreshing state... [id=eni-0da878f06d90dcde9]
aws_route_table_association.private["us-east-1e"]: Refreshing state... [id=rtbassoc-07e1e368e5fb6fbcd]
aws_route.main6: Refreshing state... [id=r-rtb-0efda81da4e7baf2b2750132062]
aws_route_table_association.private["us-east-1f"]: Refreshing state... [id=rtbassoc-0f9985420e6d42686]
aws_route_table_association.private["us-east-1a"]: Refreshing state... [id=rtbassoc-0c03b064cbe58bb27]
aws_route_table_association.private["us-east-1c"]: Refreshing state... [id=rtbassoc-05bf1c64dde7d3001]
aws_route_table_association.private["us-east-1b"]: Refreshing state... [id=rtbassoc-0c0159705bf0df21a]
aws_route_table_association.private["us-east-1d"]: Refreshing state... [id=rtbassoc-0f6ddbb66ac06b1fb]
aws_route.main: Refreshing state... [id=r-rtb-0efda81da4e7baf2b1080289494]
aws_security_group_rule.ws_writer_lb: Refreshing state... [id=sgrule-71149243]
aws_security_group.ws_reader: Refreshing state... [id=sg-05f795128b295c504]
aws_apigatewayv2_integration.upload_telem: Refreshing state... [id=cnw9e24]
aws_lambda_permission.upload_telem: Refreshing state... [id=02a8513f-50e7-5938-9f50-d47a208ea9c4]
aws_lb.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:loadbalancer/app/ws/d29968044c69f0da]
aws_route_table_association.public["us-east-1a"]: Refreshing state... [id=rtbassoc-076de61e98b8d24c6]
aws_route_table_association.public["us-east-1b"]: Refreshing state... [id=rtbassoc-058a38abf9f2db008]
aws_route_table_association.public["us-east-1c"]: Refreshing state... [id=rtbassoc-04f6b072cd2757eb1]
aws_route_table_association.public["us-east-1d"]: Refreshing state... [id=rtbassoc-0876fcc853d907d22]
aws_route_table_association.public["us-east-1e"]: Refreshing state... [id=rtbassoc-0f7a085597490861b]
aws_route_table_association.public["us-east-1f"]: Refreshing state... [id=rtbassoc-08ea26e46a3175313]
aws_ecs_service.ws_writer: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-writer]
aws_apigatewayv2_route.stations: Refreshing state... [id=mdkjsnl]
aws_apigatewayv2_route.history: Refreshing state... [id=wytcqsn]
aws_apigatewayv2_route.get_listener_telemetry: Refreshing state... [id=wcyj71b]
aws_route53_record.predict_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_AAAA]
aws_route53_record.predict_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_A]
aws_apigatewayv2_route.reverse_predictions: Refreshing state... [id=r9jwvbm]
aws_apigatewayv2_route.get_sondes: Refreshing state... [id=6eghzch]
aws_apigatewayv2_route.get_telem: Refreshing state... [id=6y7jyfq]
aws_apigatewayv2_route.get_sites: Refreshing state... [id=pzuni2l]
aws_elasticsearch_domain.ElasticsearchDomain: Refreshing state... [id=arn:aws:es:us-east-1:143841941773:domain/sondes-v2]
aws_iam_role.auth_role: Refreshing state... [id=Cognito_sondesAuth_Role]
aws_iam_role.unauth_role: Refreshing state... [id=Cognito_sondesUnauth_Role]
aws_apigatewayv2_route.predictions: Refreshing state... [id=s9z3t7t]
aws_cloudfront_distribution.sondehub: Refreshing state... [id=E79DTM5JX0RNU]
aws_ecs_service.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/Tawhiri/tawhiri]
aws_cloudfront_distribution.testing: Refreshing state... [id=E1899XF5PNG0C7]
aws_cognito_user_pool_domain.main: Refreshing state... [id=auth.v2.sondehub.org]
aws_apigatewayv2_domain_name.ApiGatewayV2DomainName: Refreshing state... [id=api-raw.v2.sondehub.org]
aws_ecs_service.ws_reader: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-reader]
aws_security_group_rule.ws_writer_reader: Refreshing state... [id=sgrule-4271061801]
aws_apigatewayv2_route.upload_telem: Refreshing state... [id=ps2g60b]
aws_route53_record.ws_reader_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws-reader_A]
aws_lb_listener.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener/app/ws/d29968044c69f0da/320139c9e787f8ac]
aws_route53_record.ws_reader_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws-reader_AAAA]
aws_route53_record.ws_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_AAAA]
aws_route53_record.ws_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_A]
aws_route53_record.tawhiri_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_AAAA]
aws_route53_record.tawhiri_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_A]
aws_route53_record.auth["A"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_A]
aws_route53_record.auth["AAAA"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_AAAA]
aws_route53_record.tracker_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_A]
aws_route53_record.root_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S__AAAA]
aws_route53_record.www_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_A]
aws_route53_record.tracker_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_AAAA]
aws_route53_record.v2_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U__AAAA]
aws_route53_record.root_A: Refreshing state... [id=Z0756308IVLVF48G6G1S__A]
aws_route53_record.www_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_AAAA]
aws_route53_record.v2_A: Refreshing state... [id=Z0571575V2EX2P3LK16U__A]
aws_route53_record.testing_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_A]
aws_route53_record.testing_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_AAAA]
aws_route53_record.api_raw: Refreshing state... [id=Z0571575V2EX2P3LK16U_api-raw_CNAME]
aws_apigatewayv2_api_mapping.ApiGatewayV2ApiMapping: Refreshing state... [id=lkd9wl]
aws_cloudfront_distribution.api: Refreshing state... [id=E3KEBAPY1913GO]
aws_route53_record.es: Refreshing state... [id=Z0571575V2EX2P3LK16U_es_CNAME]
aws_iam_role_policy.IAMPolicy: Refreshing state... [id=Cognito_sondesAuth_Role:sondes-v2]
aws_cognito_identity_pool_roles_attachment.CognitoIdentityPoolRoleAttachment: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_iam_role_policy.IAMPolicy3: Refreshing state... [id=Cognito_sondesAuth_Role:oneClick_Cognito_sondesAuth_Role_1611905520138]
aws_iam_role_policy.IAMPolicy2: Refreshing state... [id=Cognito_sondesUnauth_Role:oneClick_Cognito_sondesUnauth_Role_1611905520139]
aws_lb_listener_rule.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener-rule/app/ws/d29968044c69f0da/320139c9e787f8ac/43f26c3ee3077d14]
aws_lb_listener_rule.ws_reader: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener-rule/app/ws/d29968044c69f0da/320139c9e787f8ac/af8bbf4daa0d2d65]
aws_lambda_function.recovered_get: Refreshing state... [id=recovered_get]
aws_lambda_function.queue_data_update: Refreshing state... [id=queue_data_update]
aws_lambda_function.historic_to_s3: Refreshing state... [id=historic_to_s3]
aws_lambda_function.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_lambda_function.recovered_put: Refreshing state... [id=recovered_put]
aws_lambda_function.predict_updater: Refreshing state... [id=predict_updater]
aws_route53_record.api_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_A]
aws_route53_record.api_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_AAAA]
aws_lambda_permission.history_cron: Refreshing state... [id=terraform-20210802123205008600000001]
aws_cloudwatch_event_target.sns: Refreshing state... [id=history_queue-SendToLambda]
aws_apigatewayv2_integration.recovered_get: Refreshing state... [id=8xxwvem]
aws_lambda_permission.recovered_get: Refreshing state... [id=terraform-20210606010548494800000002]
aws_lambda_permission.recovered_put: Refreshing state... [id=terraform-20210606010536710300000001]
aws_apigatewayv2_integration.recovered_put: Refreshing state... [id=hdkf78r]
aws_lambda_event_source_mapping.historic_to_s3: Refreshing state... [id=5bb8546b-2e64-4bf2-aae1-b94c6337e4e8]
aws_lambda_permission.predict_updater: Refreshing state... [id=terraform-20210913041550353600000001]
aws_cloudwatch_event_target.predict_updater: Refreshing state... [id=predict_updater-SendToLambda]
aws_lambda_event_source_mapping.sqs_to_elk: Refreshing state... [id=33b4ab9d-4977-43e7-a994-dc90290ff9b9]
aws_apigatewayv2_route.recovered_get: Refreshing state... [id=eysilfn]
aws_apigatewayv2_route.recovered_put: Refreshing state... [id=e88oqzm]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_network_interface.ws_pad[0] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-0da878f06d90dcde9"
        id                 = "eni-0da878f06d90dcde9"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[6] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-069ebf56c9e4fdd7f"
        id                 = "eni-069ebf56c9e4fdd7f"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[1] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-0d808bd7acad70c66"
        id                 = "eni-0d808bd7acad70c66"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[4] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-01e4afb86960a27cf"
        id                 = "eni-01e4afb86960a27cf"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[8] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-07c92d00c031482ec"
        id                 = "eni-07c92d00c031482ec"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[7] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-054a9210306259e1b"
        id                 = "eni-054a9210306259e1b"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[5] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-0776494ae4f908042"
        id                 = "eni-0776494ae4f908042"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[2] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-0ddc45ce32abb4a58"
        id                 = "eni-0ddc45ce32abb4a58"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_network_interface.ws_pad[3] has been changed
  ~ resource "aws_network_interface" "ws_pad" {
      + arn                = "arn:aws:ec2:us-east-1:143841941773:network-interface/eni-0d40407d608d35e38"
        id                 = "eni-0d40407d608d35e38"
      + ipv4_prefix_count  = 0
      + ipv4_prefixes      = []
      + ipv6_prefix_count  = 0
      + ipv6_prefixes      = []
      + owner_id           = "143841941773"
        tags               = {}
        # (13 unchanged attributes hidden)
    }
  # aws_cloudfront_distribution.testing has been changed
  ~ resource "aws_cloudfront_distribution" "testing" {
        id                             = "E1899XF5PNG0C7"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }
  # aws_cloudfront_distribution.api has been changed
  ~ resource "aws_cloudfront_distribution" "api" {
        id                             = "E3KEBAPY1913GO"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ ordered_cache_behavior {
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }
  # aws_cloudfront_distribution.sondehub has been changed
  ~ resource "aws_cloudfront_distribution" "sondehub" {
        id                             = "E79DTM5JX0RNU"
        tags                           = {}
        # (19 unchanged attributes hidden)


      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

      ~ ordered_cache_behavior {
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (6 unchanged blocks hidden)
    }
  # aws_cloudfront_distribution.card has been changed
  ~ resource "aws_cloudfront_distribution" "card" {
        id                             = "E1U5IIXI87Q160"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }
  # aws_cloudfront_distribution.predict has been changed
  ~ resource "aws_cloudfront_distribution" "predict" {
        id                             = "E258SM01Q3NTFC"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test123 will be created
  + resource "aws_s3_bucket" "test123" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: prod.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "prod.plan"

```

</details>

*Pusher: @TheSkorm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*